Q1. What is a database? Differentiate between SQL and NoSQL databases.

Sol1: A database is an organized collection of data, so that it can be easily accessed and managed.
 A SQL database is a database where data is defied in form of tables whereas NoSQL  database stads for not only SQL batabase, these database include  document, key-value, graph,audio, video etc.

Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

DDL stands for data defining language and is a set of SQL commands used to create, modify, and delete database structures but not data.

(1). CRETAE : This command is used to create the database or its objects.
example: syntax of creating database:
 CREATE TABLE table_name 
 (
  Column1 datatype (size),
  column2 datatype (size),
  columnN datatype(size)
  );

(2). Drop : This command is used to delete the database or its objects.
example: syntax of deleting  table name:
 DROP DATABASE database_name;

(3). Alter : The ALTER TABLE statement in SQL is used to add, remove, or modify columns in an existing table. 
example: syntax of Alter table :
 ALTER TABLE TABLE_NAME
 ADD Column_name datatype(size)

(4). Truncate :  Truncate is used to delete the data inside the table not the whole table.
example: syntax of Truncating a table :
TRUNCATE TABLE table_name;


truncate holds the table structure i memory ad delete all its data

Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

DML:
    DML stands for Data Manipulation Language which includes SQL commands that deal with the manipulation of data present in the database and this includes most of the SQL statements.

(1). INSERT: This query is used to insert data into table
There are 2 ways of using INSERT INTO statement
 A) The first method is to specify only the value of data to be inserted without the column names:
 
 suppose we have a table having columns naming 
 ROLL_NO, NAME,	ADDRESS, PHONE, Age :
 syntax of Inserrt query:
 
 INSERT INTO TABLE table_name VALUES
 ('01', 'RIK', 'ABC', 'XXXXXXX', '21');
 
 B) The 2nd method is to specify the column name with the values:
  
 INSERT INTO table_name
 (ROLL_NO, NAME, Age) VALUES ('5','PRATIK','19');

(2). UPDATE: It is used to update existing data within a table.

UPDATE table_name SET columnName  
= 'value to be given' WHERE colum_name = reference value;

(3).DELETE: It is used to delete existing single/multiple records in a table. 

 DELETE FROM table_name WHERE some_condition;

Q4. What is DQL? Explain SELECT with an example.

SOl:
    DQL stands Data query language and it is a component of SQL statement that allows getting data from the database and imposing order upon it.

Select: It is used to retrieve data from the database. We can fetch either the entire table or according to some specified rules. The data returned is stored in a result table. 

Example: To Fetch all the data from table: 
SELECT * FROM table_name; 
* is for getting all data from table.

Q5. Explain Primary Key and Foreign Key.

Sol:  
 The primary key is a unique or non-null key that uniquely identifies every record in a table or relation. The primary key column can't store duplicate values.
 
 Foreign key is used to maintain relationship between two tables. It is used to establish a link between the two tables and is used to enforce referential integrity in the database.

Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

#code for coencting python to mysql
import mysql.connector
mydb = mysql.connector.connect(
    host = "localhost"
    user = "rik"
    password = "password"
)
print(mydb)
mycursor = mydb.cursor()
mycursor.execute "SHOW DATABASES"
for x in mycursor:
    print(x)

Q7:Give the order of execution of SQL clauses in an SQL query.

Sol:1.FROM 
    2.WHERE
    3.GROUP BY
    4.HAVING    
    5.SELECT
    6.ORDER BY
    7.LIMIT